{
  "index": {
    "subtitle": "Scala",
    "about": "Scala is an acronym for “Scalable Language”. This means that Scala grows with you. You can play with it by typing one-line expressions and observing the results. But you can also rely on it for large mission critical systems, as many companies, including Twitter, LinkedIn, or Intel do. To some, Scala feels like a scripting language. Its syntax is concise and low ceremony; its types get out of the way because the compiler can infer them. There’s a REPL and IDE worksheets for quick feedback.",
    "site": "http://www.scala-lang.org/",
    "image": "scala.jpg",
    "partners": [
      {
        "site" : "newcircle",
        "site_url": "https://thenewcircle.com",
        "lang": "en",
        "image": "newcircle.jpg",
        "publish": true,
        "videos": [
          {
            "title": "Scala Collections: Why Not?",
            "description": "Paul Phillips, Typesafe co-founder and the most prolific committer to Scala, talks about the language he spent the last five years working to develop.",
            "duration": "45:42",
            "level": "a",
            "url": "https://thenewcircle.com/s/post/1568/scala_collections_why_not_paul_phillips_video"
          },
          {
            "title": "Learning Scalaz",
            "description": "So you've heard about Scalaz and now you want to learn it. Eugene Yokota explains some best practices for diving in and emphasizes the importance of getting your hands dirty.",
            "duration": "29:15",
            "level": "i",
            "url": "https://thenewcircle.com/s/post/1578/learning_scalaz_eugene_yokota_video"
          },
          {
            "title": "Type vs Macros",
            "description": "Are you ready for an epic battle? Types and Macros enter the ring, who will come out victorious?",
            "duration": "39:52",
            "level": "i",
            "url": "https://thenewcircle.com/s/post/1582/macros_vs_types_eugene_burmako_lars_hupel_video"
          },
          {
            "title": "An Introduction to Scalaz-Stream",
            "description": "Paul Chiusano provides an overview of the library, shows its program model, and walks us through some examples of its use.",
            "duration": "29:15",
            "level": "a",
            "url": "https://thenewcircle.com/s/post/1583/an_introduction_to_scalaz_stream_paul_chiusano_video"
          },
          {
            "title": "Sbt 1.0 - The Interactive Build Tool",
            "description": "This is a quick introduction to sbt 1.0. Josh Suereth describes the new features coming with the 1.0 release and includes a demonstration of the client-server prototype.",
            "duration": "22:40",
            "level": "i",
            "url": "https://thenewcircle.com/s/post/1590/sbt_1_0_the_interactive_build_tool_josh_suereth_video"
          },
          {
            "title": "Scala Macros",
            "description": "Macros are handy tools, but can also cause a lot of headaches. Adriaan Moors discusses common pitfalls, and how you can make them IDE friendly, in hopes of making macros a little less scary.",
            "duration": "48:27",
            "level": "a",
            "url": "https://thenewcircle.com/s/post/1607/scala_macros_adriaan_moors_video"
          }
        ]
      }
    ]
  }
}